app/Controllers/homepageController.php

SELECT *
FROM `banner`
---
    public function getBannerModel()
    {
        $bannerModel = new bannerModel();
        return $bannerModel->findAll();

SELECT *
FROM `categories`
---
    public function getCategoryData()
    {
        $categoryModel = new categoryModel();
        $categoryModel = $categoryModel->findall();

SELECT *
FROM `featured_collection`
---
    public function getfeaturedCollectionData()
    {
        $featuredCollectionModel = new featuredCollectionModel();
        $featuredCollectionModel = $featuredCollectionModel->findall();